<unk>	0
[laughter]	0
[noise]	0
[vocalized-noise]	0
▁	-1.56422
s	-3.0628
t	-3.08396
e	-3.39573
▁i	-3.57774
a	-3.6124
y	-3.64718
d	-3.71548
i	-3.83451
and	-3.87948
n	-4.14054
en	-4.18822
▁wa	-4.25035
the	-4.31299
f	-4.31826
▁wh	-4.31993
u	-4.39175
w	-4.39378
m	-4.42877
▁that	-4.49417
b	-4.58667
ve	-4.59408
▁to	-4.60076
▁we	-4.60359
▁in	-4.6528
ng	-4.70528
c	-4.71916
▁m	-4.73668
or	-4.78064
on	-4.82695
▁s	-4.86913
ed	-4.92573
ch	-4.97314
▁a	-4.99203
o	-4.9953
r	-5.0426
▁of	-5.14315
our	-5.14832
her	-5.1552
te	-5.18025
p	-5.21187
ou	-5.33774
'	-5.33981
all	-5.33981
▁fi	-5.37236
▁son	-5.38677
re	-5.39847
id	-5.44476
ca	-5.53375
wo	-5.55089
ri	-5.57068
rough	-5.58981
et	-5.59126
▁kn	-5.59143
ra	-5.60083
▁so	-5.60812
at	-5.63097
▁pe	-5.69271
▁me	-5.80489
▁st	-5.84372
er	-5.86818
other	-5.90816
▁thou	-5.92314
▁li	-5.92314
▁famil	-5.92314
▁hu	-5.92314
▁go	-5.92314
▁six	-5.92323
ear	-5.92573
▁some	-5.92826
▁no	-5.93341
op	-5.93915
▁wi	-5.94306
▁be	-5.95182
use	-5.95565
▁de	-5.99168
an	-6.06511
ter	-6.07924
ie	-6.18226
im	-6.24522
▁wom	-6.40949
k	-6.41946
▁gr	-6.42314
▁shock	-6.42314
▁sympathy	-6.42314
▁terrible	-6.42314
▁victim	-6.42314
positi	-6.42314
x	-7.42276
q	-7.42313
j	-7.42314
z	-7.42314
v	-7.44756
g	-7.44766
l	-7.44776
h	-7.44786
