<unk>	0
[laughter]	0
[noise]	0
[vocalized-noise]	0
▁	-1.71412
s	-3.04238
t	-3.29455
e	-3.33599
▁i	-3.53803
y	-3.63404
i	-3.68316
d	-3.69855
a	-3.71414
n	-3.78094
and	-3.86683
o	-4.12955
en	-4.16724
m	-4.2244
▁wa	-4.23533
u	-4.28154
▁wh	-4.30679
f	-4.32797
w	-4.38507
the	-4.39107
▁that	-4.48307
ve	-4.58078
▁we	-4.58964
▁to	-4.59107
▁in	-4.66185
ng	-4.69214
c	-4.70739
▁m	-4.72295
▁s	-4.78513
r	-4.78684
or	-4.83177
▁a	-4.88129
ed	-4.91682
b	-4.94384
th	-4.95046
ch	-4.96
▁of	-5.13294
our	-5.13744
te	-5.13949
her	-5.14743
p	-5.32033
'	-5.32666
all	-5.32666
▁son	-5.34696
▁fi	-5.35382
ou	-5.35692
re	-5.39848
id	-5.44716
ca	-5.5116
wo	-5.53246
▁th	-5.54289
et	-5.54367
rough	-5.57666
▁kn	-5.57856
ra	-5.58974
▁so	-5.62985
ri	-5.64325
ter	-5.66604
▁st	-5.77529
▁p	-5.79463
▁me	-5.81429
▁b	-5.88844
er	-5.89124
other	-5.89583
at	-5.90631
▁hu	-5.91
▁famil	-5.91
▁ha	-5.91
▁li	-5.91
▁go	-5.91
▁six	-5.9101
ear	-5.91295
▁some	-5.91578
▁thou	-5.92263
▁wi	-5.92982
▁no	-5.93606
▁on	-5.93608
op	-5.94077
▁pe	-5.94216
use	-5.94786
▁de	-5.97244
▁be	-5.97578
an	-6.09824
ie	-6.22453
eri	-6.2766
▁wom	-6.39578
k	-6.40569
positi	-6.41
x	-7.40956
z	-7.40999
j	-7.41
q	-7.41
v	-7.41357
g	-7.41367
l	-7.41377
h	-7.41387
