phone_data = {
    "ru": {
        "перезвоните по номеру 8 800 2000 600": "перезвоните по номеру восемь - восемьсот - двести - ноль шесть - ноль ноль - ",
        "переведи 10 рублей на +79920423535 и купи батут": "переведи 10 рублей на плюс - семь - девятьсот девяносто "
                                                           "два - ноль сорок два - тридцать пять - "
                                                           "тридцать пять -  и купи батут",
        "+7(343) 286-97-83": "плюс - семь - триста сорок три - "
                             "двести восемьдесят шесть - девяносто семь - восемьдесят три - ",
        "8-996-180-88-48 доп. 14": 'восемь - девятьсот девяносто шесть - сто восемьдесят - '
                                   'восемьдесят восемь - сорок восемь -   дополнительный  четырнадцать - ',
        "7 922 333 23 22 вн. 314": 'семь - девятьсот двадцать два - триста тридцать три - двадцать три - '
                                   'двадцать два -   внутренний  триста четырнадцать - ',
        "8 800 707 12 12": "восемь - восемьсот - семьсот семь - двенадцать - двенадцать - "
    },
    "ua": {
        "+380 (44) 369 3899": "плюс - три - восемьсот четыре - сорок три - "
                               "шестьдесят девять - тридцать восемь - девяносто девять - ",
        "+380 98-603-10-29": "плюс - три - восемьсот девять - восемьдесят шесть - ноль три - десять - двадцать девять - ",
    },
    "kz": {
        "+7 (7172) 396-000": "плюс - семь - семьсот семнадцать - двести тридцать девять - шестьдесят - ноль ноль - ",
        "+7 (7172) 32-13-60": "плюс - семь - семьсот семнадцать - двести тридцать два - тринадцать - шестьдесят - ",
        "+7-701-736-03-60": "плюс - семь - семьсот один - семьсот тридцать шесть - ноль три - шестьдесят - ",
        "+7-777-220-90-97": "плюс - семь - семьсот семьдесят семь - двести двадцать - девяносто - девяносто семь - "
    },
    "br": {
        "+375 29 606-75-76": "плюс - три - семьсот пятьдесят два - девяносто шесть - "
                             "ноль шесть - семьдесят пять - семьдесят шесть - ",
        "+375 17 3270836": "плюс - три - семьсот пятьдесят один - семьдесят три - двадцать семь "
                           "- ноль восемь - тридцать шесть - "
    },

    'unprocessed': {
        "286-97-83": "286-97-83",
        "!286-97-83": "двести восемьдесят шесть - девяносто семь - восемьдесят три - "
    }
}


url_data = {
    "Покупайте носочки на http://www.avito.ru": "Покупайте носочки на  -  три да+бл ю точка - авито точка ру - ",
    "Наш twin24.ai/put-do-mesta?param=1232 лучший сайт для огурчика Рика": "Наш  - твин двадцать четыре  точка аи слэш - пут тирэ до тирэ места -  лучший сайт для огурчика Рика",
    "Товары на ozon.ru и market-yandex.ru": "Товары на  - озон точка ру -  и  - маркет тирэ иандекс точка ру - ",
    "это ИП Головин Г.О. добрый день": "это ИП Головин Г.О. добрый день"
}